mikaelpatel/Cosa/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2013, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
# 
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
# 
# You should have received a copy of the GNU Lesser General
# Public License along with this library; if not, write to the
# Free Software Foundation, Inc., 59 Temple Place, Suite 330,
# Boston, MA  02111-1307  USA
#
# @section Description
# The Cosa Arduino core boards definition file.
#
# This file is part of the Arduino Che Cosa project.

##
# ARDUINO TINY
##

# AVR:ATtiny84
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny84-8.name=Cosa Tiny (ATtiny84, 8 MHz internal clock)
attiny84-8.upload.using=arduino:arduinoisp
attiny84-8.bootloader.low_fuses=0xe2
attiny84-8.bootloader.high_fuses=0xdf
attiny84-8.bootloader.extended_fuses=0xff
attiny84-8.upload.maximum_size=8192
attiny84-8.build.mcu=attiny84
attiny84-8.build.f_cpu=8000000L
attiny84-8.build.core=cosa

# AVR:ATtiny85
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny85-8.name=Cosa Tiny (ATtiny85, 8 MHz internal clock)
attiny85-8.upload.using=arduino:arduinoisp
attiny85-8.bootloader.low_fuses=0xe2
attiny85-8.bootloader.high_fuses=0xdf
attiny85-8.bootloader.extended_fuses=0xff
attiny85-8.upload.maximum_size=8192
attiny85-8.build.mcu=attiny85
attiny85-8.build.f_cpu=8000000L
attiny85-8.build.core=cosa

# AVR:ATtiny861
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms
# Brown-out detection disabled. Serial program downloading enabled
attiny861-8.name=Cosa Tiny (ATtiny861, 8 MHz internal clock)
attiny861-8.upload.using=arduino:arduinoisp
attiny861-8.bootloader.low_fuses=0xe2
attiny861-8.bootloader.high_fuses=0xdf
attiny861-8.bootloader.extended_fuses=0x01
attiny861-8.upload.maximum_size=8192
attiny861-8.build.mcu=attiny861
attiny861-8.build.f_cpu=8000000L
attiny861-8.build.core=cosa

##
# ARDUINO BREADBOARD
##

# AVR:ATmega328
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
atmega328-8.name=Cosa Arduino Basetta (ATmega328, 8 MHz internal clock)
# atmega328-8.upload.using=arduino:arduinoisp
atmega328-8.upload.protocol=usbasp
atmega328-8.upload.maximum_size=32256
atmega328-8.upload.speed=115200
atmega328-8.bootloader.low_fuses=0xE2
atmega328-8.bootloader.high_fuses=0xDE
atmega328-8.bootloader.extended_fuses=0xFD
atmega328-8.build.mcu=atmega328p
atmega328-8.build.f_cpu=8000000L
atmega328-8.build.core=cosa

##
# ARDUINO STANDARD
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00). 
uno.name=Cosa Arduino Uno (ATmega328)
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
duemilanove.name=Cosa Arduino Duemilanove (ATmega328)
duemilanove.upload.protocol=arduino
duemilanove.upload.maximum_size=30720
duemilanove.upload.speed=57600
duemilanove.bootloader.low_fuses=0xFF
duemilanove.bootloader.high_fuses=0xDA
duemilanove.bootloader.extended_fuses=0x05
duemilanove.build.mcu=atmega328p
duemilanove.build.f_cpu=16000000L
duemilanove.build.core=cosa

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0x3c00). 
nano.name=Cosa Arduino Nano (ATmega328)
nano.upload.protocol=arduino
nano.upload.maximum_size=30720
nano.upload.speed=57600
nano.bootloader.low_fuses=0xFF
nano.bootloader.high_fuses=0xDA
nano.bootloader.extended_fuses=0x05
nano.build.mcu=atmega328p
nano.build.f_cpu=16000000L
nano.build.core=cosa

lilypad.name=Cosa LilyPad Arduino (ATmega328, 8 MHz)
lilypad.upload.protocol=arduino
lilypad.upload.maximum_size=30720
lilypad.upload.speed=57600
lilypad.bootloader.low_fuses=0xFF
lilypad.bootloader.high_fuses=0xDA
lilypad.bootloader.extended_fuses=0x05
lilypad.build.mcu=atmega328p
lilypad.build.f_cpu=8000000L
lilypad.build.core=cosa

pro-mini.name=Cosa Arduino Pro Mini (ATmega328)
pro-mini.upload.protocol=arduino
pro-mini.upload.maximum_size=30720
pro-mini.upload.speed=57600
pro-mini.bootloader.low_fuses=0xFF
pro-mini.bootloader.high_fuses=0xDA
pro-mini.bootloader.extended_fuses=0x05
pro-mini.build.mcu=atmega328p
pro-mini.build.f_cpu=16000000L
pro-mini.build.core=cosa

pro-mini-8.name=Cosa Arduino Pro Mini (ATmega328, 3.3V, 8 MHz)
pro-mini-8.upload.protocol=arduino
pro-mini-8.upload.maximum_size=30720
pro-mini-8.upload.speed=57600
pro-mini-8.bootloader.low_fuses=0xFF
pro-mini-8.bootloader.high_fuses=0xDA
pro-mini-8.bootloader.extended_fuses=0x05
pro-mini-8.build.mcu=atmega328p
pro-mini-8.build.f_cpu=8000000L
pro-mini-8.build.core=cosa

##
# ARDUINO MIGHTY
##

# AVR:ATmega1248
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (1024 words, 0xfc00). 
mighty.name=Cosa Arduino Mighty (ATmega1284)
mighty.upload.protocol=stk500v1
mighty.upload.maximum_size=129024
mighty.upload.speed=57600
mighty.bootloader.low_fuses=0xff
mighty.bootloader.high_fuses=0xdc
mighty.bootloader.extended_fuses=0xfd
mighty.build.mcu=atmega1284p
mighty.build.f_cpu=16000000L
mighty.build.core=cosa

# AVR:ATmega1248
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00). 
mighty-opt.name=Cosa Arduino Mighty (ATmega1284, Optiboot)
mighty-opt.upload.protocol=arduino
mighty-opt.upload.maximum_size=130048
mighty-opt.upload.speed=115200
mighty-opt.bootloader.low_fuses=0xff
mighty-opt.bootloader.high_fuses=0xde
mighty-opt.bootloader.extended_fuses=0xfd
mighty-opt.build.mcu=atmega1284p
mighty-opt.build.f_cpu=16000000L
mighty-opt.build.core=cosa

##
# ARDUINO MEGA
##

# AVR:ATmega2560
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000). 
mega.name=Cosa Arduino Mega (ATmega2560)
mega.upload.protocol=wiring
mega.upload.maximum_size=258048
mega.upload.speed=115200
mega.bootloader.low_fuses=0xFF
mega.bootloader.high_fuses=0xD8
mega.bootloader.extended_fuses=0xFD
mega.build.mcu=atmega2560
mega.build.f_cpu=16000000L
mega.build.core=cosa
